run/icoPhaseChangeVoF/testSolidification/0/alpha.bismuth.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.bismuth;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 1;

boundaryField
{
    "(right|left|bottom|top)"
    {
        //type            zeroGradient;
        type            fixedValue;
        value           $internalField;
    }

    /*
    top
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    */

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //