run/icoPhaseChangeVoF/testSolidification/system/locateInterface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes a volVectorField of grad(p)

\*---------------------------------------------------------------------------*/

libs     ("libutilityFunctionObjects.so");
type     coded;

writeControl writeTime;

//Ta      ${${FOAM_CASE}/0/T!Tinlet};
//T       ${${FOAM_CASE}/0/T!Twall};

// Header files for classes and functions, e.g. for fvc::grad
codeInclude
#{
    #include "OFstream.H"
    #include "OSspecific.H"
    #include "writeFile.H"
#};

// Header file paths for Make/options, e.g. for momentum transport models
// Example:
// -I$(LIB_SRC)/MomentumTransportModels/incompressible/lnInclude
codeOptions
#{
#};

// Linked libraries for Make/options, e.g. for momentum transport models
// Not usually required since libraries are already linked to the solver
// Example:
// -lincompressibleMomentumTransportModels
codeLibs
#{
#};

codeFields
#{
    // Read fields when executing function objects with "foamPostProcess"
    fields.append("alpha.solid.bismuth");
#};

codeWrite
#{
    const volScalarField& alpha = mesh().lookupObject<volScalarField>(fields()[0]);
    scalar x = 0;
    scalar n = 1;
    forAll(alpha, cellI)
    {
        if (alpha[cellI]> 0.05 && alpha[cellI]<0.95)
        {
            x += mesh().C()[cellI].x();
            n += 1.0;
        }
    }
    x /= n;

    const fileName filePath
    (
        mesh().time().rootPath()
       /mesh().time().globalCaseName()
       /functionObjects::writeFile::outputPrefix
    );

    mkDir(filePath);

    OFstream os
    (
        filePath + "/" + "data_" + Foam::name(Pstream::myProcNo()) + ".csv",
        OFstream::ASCII,
        OFstream::currentVersion,
        OFstream::UNCOMPRESSED,
        true
    );

    os << mesh().time().name() << " " << x << ";" << endl;

    Info<<"Average interface location x = " << x <<endl;
#};

// ************************************************************************* //
